QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/include/platform/hal/nxp/mcu/LPC17xx/vendor/LPC1788.h
  __IO uint32_t P2_16;              /* 0x140 */
  __IO uint32_t P2_17;
  __IO uint32_t P2_18;
  __IO uint32_t P2_19;
  __IO uint32_t P2_20;
  __IO uint32_t P2_21;
  __IO uint32_t P2_22;
  __IO uint32_t P2_23;

  __IO uint32_t P2_24;              /* 0x160 */
  __IO uint32_t P2_25;
  __IO uint32_t P2_26;
  __IO uint32_t P2_27;
  __IO uint32_t P2_28;
  __IO uint32_t P2_29;
  __IO uint32_t P2_30;
  __IO uint32_t P2_31;

  __IO uint32_t P3_0;               /* 0x180 */
  __IO uint32_t P3_1;
  __IO uint32_t P3_2;
  __IO uint32_t P3_3;
  __IO uint32_t P3_4;
  __IO uint32_t P3_5;
  __IO uint32_t P3_6;
  __IO uint32_t P3_7;

  __IO uint32_t P3_8;               /* 0x1A0 */
  __IO uint32_t P3_9;
  __IO uint32_t P3_10;
  __IO uint32_t P3_11;
  __IO uint32_t P3_12;
  __IO uint32_t P3_13;
  __IO uint32_t P3_14;
  __IO uint32_t P3_15;

  __IO uint32_t P3_16;              /* 0x1C0 */
  __IO uint32_t P3_17;
  __IO uint32_t P3_18;
  __IO uint32_t P3_19;
  __IO uint32_t P3_20;
  __IO uint32_t P3_21;
  __IO uint32_t P3_22;
  __IO uint32_t P3_23;

  __IO uint32_t P3_24;              /* 0x1E0 */
  __IO uint32_t P3_25;
  __IO uint32_t P3_26;
  __IO uint32_t P3_27;
  __IO uint32_t P3_28;
  __IO uint32_t P3_29;
  __IO uint32_t P3_30;
  __IO uint32_t P3_31;

  __IO uint32_t P4_0;               /* 0x200 */
  __IO uint32_t P4_1;
  __IO uint32_t P4_2;
  __IO uint32_t P4_3;
  __IO uint32_t P4_4;
  __IO uint32_t P4_5;
  __IO uint32_t P4_6;
  __IO uint32_t P4_7;

  __IO uint32_t P4_8;               /* 0x220 */
  __IO uint32_t P4_9;
  __IO uint32_t P4_10;
  __IO uint32_t P4_11;
  __IO uint32_t P4_12;
  __IO uint32_t P4_13;
  __IO uint32_t P4_14;
  __IO uint32_t P4_15;

  __IO uint32_t P4_16;              /* 0x240 */
  __IO uint32_t P4_17;
  __IO uint32_t P4_18;
  __IO uint32_t P4_19;
  __IO uint32_t P4_20;
  __IO uint32_t P4_21;
  __IO uint32_t P4_22;
  __IO uint32_t P4_23;

  __IO uint32_t P4_24;              /* 0x260 */
  __IO uint32_t P4_25;
  __IO uint32_t P4_26;
  __IO uint32_t P4_27;
  __IO uint32_t P4_28;
  __IO uint32_t P4_29;
  __IO uint32_t P4_30;
  __IO uint32_t P4_31;

  __IO uint32_t P5_0;               /* 0x280 */
  __IO uint32_t P5_1;
  __IO uint32_t P5_2;
  __IO uint32_t P5_3;
  __IO uint32_t P5_4;               /* 0x290 */
} LPC_IOCON_TypeDef;

/*------------- General Purpose Input/Output (GPIO) --------------------------*/
typedef struct
{
  __IO uint32_t DIR;                        /*!< Offset: 0x000 (R/W)  GPIO port Direction Register */
       uint32_t RESERVED0[3];
  __IO uint32_t MASK;                       /*!< Offset: 0x010 (R/W)  GPIO port Mask Register */
  __IO uint32_t PIN;                        /*!< Offset: 0x014 (R/W)  GPIO port Pin value Register */
  __IO uint32_t SET;                        /*!< Offset: 0x018 (R/W)  GPIO port output Set Register */
  __O  uint32_t CLR;                        /*!< Offset: 0x01C ( /W)  GPIO port output Clear Register */
} LPC_GPIO_TypeDef;

typedef struct
{
  __I  uint32_t IntStatus;                  /*!< Offset: 0x000 (R/ )  GPIO overall Interrupt Status Register */
  __I  uint32_t IO0IntStatR;                /*!< Offset: 0x004 (R/ )  GPIO Interrupt Status Register 0 for Rising edge */
  __I  uint32_t IO0IntStatF;                /*!< Offset: 0x008 (R/ )  GPIO Interrupt Status Register 0 for Falling edge */
  __O  uint32_t IO0IntClr;                  /*!< Offset: 0x00C (R/W)  GPIO Interrupt Clear  Register 0 */
  __IO uint32_t IO0IntEnR;                  /*!< Offset: 0x010 ( /W)  GPIO Interrupt Enable Register 0 for Rising edge */
  __IO uint32_t IO0IntEnF;                  /*!< Offset: 0x014 (R/W)  GPIO Interrupt Enable Register 0 for Falling edge */
       uint32_t RESERVED0[3];
  __I  uint32_t IO2IntStatR;                /*!< Offset: 0x000 (R/ )  GPIO Interrupt Status Register 2 for Rising edge */
  __I  uint32_t IO2IntStatF;                /*!< Offset: 0x000 (R/ )  GPIO Interrupt Status Register 2 for Falling edge */
  __O  uint32_t IO2IntClr;                  /*!< Offset: 0x000 ( /W)  GPIO Interrupt Clear  Register 2 */
  __IO uint32_t IO2IntEnR;                  /*!< Offset: 0x000 (R/W)  GPIO Interrupt Enable Register 2 for Rising edge */
  __IO uint32_t IO2IntEnF;                  /*!< Offset: 0x000 (R/W)  GPIO Interrupt Enable Register 2 for Falling edge */
} LPC_GPIOINT_TypeDef;

/*------------- Timer (TIM) --------------------------------------------------*/
typedef struct
{
  __IO uint32_t IR;                         /*!< Offset: 0x000 (R/W)  Interrupt Register */
  __IO uint32_t TCR;                        /*!< Offset: 0x004 (R/W)  Timer Control Register */
  __IO uint32_t TC;                         /*!< Offset: 0x008 (R/W)  Timer Counter Register */
  __IO uint32_t PR;                         /*!< Offset: 0x00C (R/W)  Prescale Register */
  __IO uint32_t PC;                         /*!< Offset: 0x010 (R/W)  Prescale Counter Register */
  __IO uint32_t MCR;                        /*!< Offset: 0x014 (R/W)  Match Control Register */
  __IO uint32_t MR0;                        /*!< Offset: 0x018 (R/W)  Match Register 0 */
  __IO uint32_t MR1;                        /*!< Offset: 0x01C (R/W)  Match Register 1 */
  __IO uint32_t MR2;                        /*!< Offset: 0x020 (R/W)  Match Register 2 */
  __IO uint32_t MR3;                        /*!< Offset: 0x024 (R/W)  Match Register 3 */
  __IO uint32_t CCR;                        /*!< Offset: 0x028 (R/W)  Capture Control Register */
  __I  uint32_t CR0;                        /*!< Offset: 0x02C (R/ )  Capture Register 0 */
  __I  uint32_t CR1;                        /*!< Offset: 0x030 (R/ )  Capture Register */
       uint32_t RESERVED0[2];
  __IO uint32_t EMR;                        /*!< Offset: 0x03C (R/W)  External Match Register */
       uint32_t RESERVED1[12];
  __IO uint32_t CTCR;                       /*!< Offset: 0x070 (R/W)  Count Control Register */
} LPC_TIM_TypeDef;

/*------------- Pulse-Width Modulation (PWM) ---------------------------------*/
typedef struct
{
  __IO uint32_t IR;                         /*!< Offset: 0x000 (R/W)  Interrupt Register */
  __IO uint32_t TCR;                        /*!< Offset: 0x004 (R/W)  Timer Control Register. Register */
  __IO uint32_t TC;                         /*!< Offset: 0x008 (R/W)  Timer Counter Register */
  __IO uint32_t PR;                         /*!< Offset: 0x00C (R/W)  Prescale Register */
  __IO uint32_t PC;                         /*!< Offset: 0x010 (R/W)  Prescale Counter Register */
  __IO uint32_t MCR;                        /*!< Offset: 0x014 (R/W)  Match Control Register */
  __IO uint32_t MR0;                        /*!< Offset: 0x018 (R/W)  Match Register 0 */
  __IO uint32_t MR1;                        /*!< Offset: 0x01C (R/W)  Match Register 1 */
  __IO uint32_t MR2;                        /*!< Offset: 0x020 (R/W)  Match Register 2 */
  __IO uint32_t MR3;                        /*!< Offset: 0x024 (R/W)  Match Register 3 */
  __IO uint32_t CCR;                        /*!< Offset: 0x028 (R/W)  Capture Control Register */
  __I  uint32_t CR0;                        /*!< Offset: 0x02C (R/ )  Capture Register 0 */
  __I  uint32_t CR1;                        /*!< Offset: 0x030 (R/ )  Capture Register 1 */
  __I  uint32_t CR2;                        /*!< Offset: 0x034 (R/ )  Capture Register 2 */
  __I  uint32_t CR3;                        /*!< Offset: 0x038 (R/ )  Capture Register 3 */
       uint32_t RESERVED0;
  __IO uint32_t MR4;                        /*!< Offset: 0x040 (R/W)  Match Register 4 */
  __IO uint32_t MR5;                        /*!< Offset: 0x044 (R/W)  Match Register 5 */
  __IO uint32_t MR6;                        /*!< Offset: 0x048 (R/W)  Match Register 6 */
  __IO uint32_t PCR;                        /*!< Offset: 0x04C (R/W)  PWM Control Register */
  __IO uint32_t LER;                        /*!< Offset: 0x050 (R/W)  Load Enable Register */
       uint32_t RESERVED1[7];
  __IO uint32_t CTCR;                       /*!< Offset: 0x070 (R/W)  Count Control Register */
} LPC_PWM_TypeDef;

/*------------- Universal Asynchronous Receiver Transmitter (UART) -----------*/
typedef struct
{
  union {
  __I  uint8_t  RBR;                        /*!< Offset: 0x000 (R/ )  Receiver Buffer Register */
  __O  uint8_t  THR;                        /*!< Offset: 0x000 ( /W)  Transmit Holding Register */
  __IO uint8_t  DLL;                        /*!< Offset: 0x000 (R/W)  Divisor Latch LSB Register */
       uint32_t RESERVED0;
  };
  union {
  __IO uint8_t  DLM;                        /*!< Offset: 0x004 (R/W)  Divisor Latch MSB Register */
  __IO uint32_t IER;                        /*!< Offset: 0x004 (R/W)  Interrupt Enable Register */
  };
  union {
  __I  uint32_t IIR;                        /*!< Offset: 0x008 (R/ )  Interrupt ID Register */
  __O  uint8_t  FCR;                        /*!< Offset: 0x008 ( /W)  FIFO Control Register */
  };
  __IO uint8_t  LCR;                        /*!< Offset: 0x00C (R/W)  Line Control Register */
       uint8_t  RESERVED1[7];
  __I  uint8_t  LSR;                        /*!< Offset: 0x014 (R/ )  Line Control Register */
       uint8_t  RESERVED2[7];
  __IO uint8_t  SCR;                        /*!< Offset: 0x01C (R/W)  Scratch Pad Register */
       uint8_t  RESERVED3[3];
  __IO uint32_t ACR;                        /*!< Offset: 0x020 (R/W)  Auto-baud Control Register */
  __IO uint8_t  ICR;                        /*!< Offset: 0x024 (R/W)  IrDA Control Register */
       uint8_t  RESERVED4[3];
  __IO uint8_t  FDR;                        /*!< Offset: 0x028 (R/W)  Fractional Divider Register */
       uint8_t  RESERVED5[7];
  __IO uint8_t  TER;                        /*!< Offset: 0x030 (R/W)  Transmit Enable Register */
} LPC_UART_TypeDef;

typedef struct
{
  union {
  __I  uint8_t  RBR;                        /*!< Offset: 0x000 (R/ )  Receiver Buffer Register */
  __O  uint8_t  THR;                        /*!< Offset: 0x000 ( /W)  Transmit Holding Register */
  __IO uint8_t  DLL;                        /*!< Offset: 0x000 (R/W)  Divisor Latch LSB Register */
       uint32_t RESERVED0;
  };
  union {
  __IO uint8_t  DLM;                        /*!< Offset: 0x004 (R/W)  Divisor Latch MSB Register */
  __IO uint32_t IER;                        /*!< Offset: 0x004 (R/W)  Interrupt Enable Register */
  };
  union {
  __I  uint32_t IIR;                        /*!< Offset: 0x008 (R/ )  Interrupt ID Register */
  __O  uint8_t  FCR;                        /*!< Offset: 0x008 ( /W)  FIFO Control Register */
  };
  __IO uint8_t  LCR;                        /*!< Offset: 0x00C (R/W)  Line Control Register */
       uint8_t  RESERVED1[7];
  __I  uint8_t  LSR;                        /*!< Offset: 0x014 (R/ )  Line Control Register */
       uint8_t  RESERVED2[7];
  __IO uint8_t  SCR;                        /*!< Offset: 0x01C (R/W)  Scratch Pad Register */
       uint8_t  RESERVED3[3];
  __IO uint32_t ACR;                        /*!< Offset: 0x020 (R/W)  Auto-baud Control Register */
  __IO uint8_t  ICR;                        /*!< Offset: 0x024 (R/W)  IrDA Control Register */
       uint8_t  RESERVED4[3];
  __IO uint8_t  FDR;                        /*!< Offset: 0x028 (R/W)  Fractional Divider Register */
       uint8_t  RESERVED5[7];
  __IO uint8_t  TER;                        /*!< Offset: 0x030 (R/W)  Transmit Enable Register */
} LPC_UART0_TypeDef;

typedef struct
{
  union {
  __I  uint8_t  RBR;                        /*!< Offset: 0x000 (R/ )  Receiver Buffer Register */
  __O  uint8_t  THR;                        /*!< Offset: 0x000 ( /W)  Transmit Holding Register */
  __IO uint8_t  DLL;                        /*!< Offset: 0x000 (R/W)  Divisor Latch LSB Register */
       uint32_t RESERVED0;
  };
  union {
  __IO uint8_t  DLM;                        /*!< Offset: 0x004 (R/W)  Divisor Latch MSB Register */
  __IO uint32_t IER;                        /*!< Offset: 0x004 (R/W)  Interrupt Enable Register */
  };
  union {
  __I  uint32_t IIR;                        /*!< Offset: 0x008 (R/ )  Interrupt ID Register */
  __O  uint8_t  FCR;                        /*!< Offset: 0x008 ( /W)  FIFO Control Register */
  };
  __IO uint8_t  LCR;                        /*!< Offset: 0x00C (R/W)  Line Control Register */
       uint8_t  RESERVED1[3];
  __IO uint8_t  MCR;                        /*!< Offset: 0x010 (R/W)  Modem Control Register */
       uint8_t  RESERVED2[3];
  __I  uint8_t  LSR;                        /*!< Offset: 0x014 (R/ )  Line Control Register */
       uint8_t  RESERVED3[3];
  __I  uint8_t  MSR;                        /*!< Offset: 0x018 (R/ )  Modem Control Register */
       uint8_t  RESERVED4[3];
  __IO uint8_t  SCR;                        /*!< Offset: 0x01C (R/W)  Scratch Pad Register */
       uint8_t  RESERVED5[3];
  __IO uint32_t ACR;                        /*!< Offset: 0x020 (R/W)  Auto-baud Control Register */
       uint32_t RESERVED6;
  __IO uint8_t  FDR;                        /*!< Offset: 0x028 (R/W)  Fractional Divider Register */
       uint8_t  RESERVED7[7];
  __IO uint8_t  TER;                        /*!< Offset: 0x030 (R/W)  Transmit Enable Register */
       uint8_t  RESERVED8[27];
  __IO uint8_t  RS485CTRL;                  /*!< Offset: 0x04C (R/W)  RS-485/EIA-485 Control Register */
       uint8_t  RESERVED9[3];
  __IO uint8_t  ADRMATCH;                   /*!< Offset: 0x050 (R/W)  RS-485/EIA-485 address match Register */
       uint8_t  RESERVED10[3];
  __IO uint8_t  RS485DLY;                   /*!< Offset: 0x054 (R/W)  RS-485/EIA-485 direction control delay Register */
} LPC_UART1_TypeDef;

/*------------- Synchronous Serial Communication (SSP) -----------------------*/
typedef struct
{
  __IO uint32_t CR0;                        /*!< Offset: 0x000 (R/W)  Control Register 0 */
  __IO uint32_t CR1;                        /*!< Offset: 0x004 (R/W)  Control Register 1 */
  __IO uint32_t DR;                         /*!< Offset: 0x008 (R/W)  Data Register */
  __I  uint32_t SR;                         /*!< Offset: 0x00C (R/ )  Status Register */
  __IO uint32_t CPSR;                       /*!< Offset: 0x010 (R/W)  Clock Prescale Register */
  __IO uint32_t IMSC;                       /*!< Offset: 0x014 (R/W)  Interrupt Mask Set and Clear Register */
  __IO uint32_t RIS;                        /*!< Offset: 0x018 (R/W)  Raw Interrupt Status Register */
  __IO uint32_t MIS;                        /*!< Offset: 0x01C (R/W)  Masked Interrupt Status Register */
  __IO uint32_t ICR;                        /*!< Offset: 0x020 (R/W)  SSPICR Interrupt Clear Register */
  __IO uint32_t DMACR;                      /*!< Offset: 0x024 (R/W)  DMA Control Register */
} LPC_SSP_TypeDef;

/*------------- Inter-Integrated Circuit (I2C) -------------------------------*/
typedef struct
{
  __IO uint32_t CONSET;                     /*!< Offset: 0x000 (R/W)  I2C Control Set Register */
  __I  uint32_t STAT;                       /*!< Offset: 0x004 (R/ )  I2C Status Register */
  __IO uint32_t DAT;                        /*!< Offset: 0x008 (R/W)  I2C Data Register */
  __IO uint32_t ADR0;                       /*!< Offset: 0x00C (R/W)  I2C Slave Address Register 0 */
  __IO uint32_t SCLH;                       /*!< Offset: 0x010 (R/W)  SCH Duty Cycle Register High Half Word */
  __IO uint32_t SCLL;                       /*!< Offset: 0x014 (R/W)  SCL Duty Cycle Register Low Half Word */
  __O  uint32_t CONCLR;                     /*!< Offset: 0x018 (R/W)  I2C Control Clear Register */
  __IO uint32_t MMCTRL;                     /*!< Offset: 0x01C (R/W)  Monitor mode control register */
  __IO uint32_t ADR1;                       /*!< Offset: 0x020 (R/W)  I2C Slave Address Register 1 */
  __IO uint32_t ADR2;                       /*!< Offset: 0x024 (R/W)  I2C Slave Address Register 2 */
  __IO uint32_t ADR3;                       /*!< Offset: 0x028 (R/W)  I2C Slave Address Register 3 */
  __I  uint32_t DATA_BUFFER;                /*!< Offset: 0x02C (R/ )  Data buffer Register */
  __IO uint32_t MASK0;                      /*!< Offset: 0x030 (R/W)  I2C Slave address mask register 0 */
  __IO uint32_t MASK1;                      /*!< Offset: 0x034 (R/W)  I2C Slave address mask register 1 */
  __IO uint32_t MASK2;                      /*!< Offset: 0x038 (R/W)  I2C Slave address mask register 2 */
  __IO uint32_t MASK3;                      /*!< Offset: 0x03C (R/W)  I2C Slave address mask register 3 */
} LPC_I2C_TypeDef;

/*------------- Inter IC Sound (I2S) -----------------------------------------*/
typedef struct
{
  __IO uint32_t DAO;                        /*!< Offset: 0x000 (R/W)  Digital Audio Output Register */
  __IO uint32_t DAI;                        /*!< Offset: 0x004 (R/W)  Digital Audio Input Register */
  __O  uint32_t TXFIFO;                     /*!< Offset: 0x008 ( /W)  Transmit FIFO */
  __I  uint32_t RXFIFO;                     /*!< Offset: 0x00C (R/ )  Receive FIFO */
  __I  uint32_t STATE;                      /*!< Offset: 0x010 (R/W)  Status Feedback Register */
  __IO uint32_t DMA1;                       /*!< Offset: 0x014 (R/W)  DMA Configuration Register 1 */
  __IO uint32_t DMA2;                       /*!< Offset: 0x018 (R/W)  DMA Configuration Register 2 */
  __IO uint32_t IRQ;                        /*!< Offset: 0x01C (R/W)  Interrupt Request Control Register */
  __IO uint32_t TXRATE;                     /*!< Offset: 0x020 (R/W)  Transmit reference clock divider Register */
  __IO uint32_t RXRATE;                     /*!< Offset: 0x024 (R/W)  Receive reference clock divider Register */
  __IO uint32_t TXBITRATE;                  /*!< Offset: 0x028 (R/W)  Transmit bit rate divider Register */
  __IO uint32_t RXBITRATE;                  /*!< Offset: 0x02C (R/W)  Receive bit rate divider Register */
  __IO uint32_t TXMODE;                     /*!< Offset: 0x030 (R/W)  Transmit mode control Register */
  __IO uint32_t RXMODE;                     /*!< Offset: 0x034 (R/W)  Receive mode control Register */
} LPC_I2S_TypeDef;


/*------------- Real-Time Clock (RTC) ----------------------------------------*/
typedef struct
{
  __IO uint8_t  ILR;                        /*!< Offset: 0x000 (R/W)  Interrupt Location Register */
       uint8_t  RESERVED0[7];
  __IO uint8_t  CCR;                        /*!< Offset: 0x008 (R/W)  Clock Control Register */
       uint8_t  RESERVED1[3];
  __IO uint8_t  CIIR;                       /*!< Offset: 0x00C (R/W)  Counter Increment Interrupt Register */
       uint8_t  RESERVED2[3];
  __IO uint8_t  AMR;                        /*!< Offset: 0x010 (R/W)  Alarm Mask Register */
       uint8_t  RESERVED3[3];
  __I  uint32_t CTIME0;                     /*!< Offset: 0x014 (R/ )  Consolidated Time Register 0 */
  __I  uint32_t CTIME1;                     /*!< Offset: 0x018 (R/ )  Consolidated Time Register 1 */
  __I  uint32_t CTIME2;                     /*!< Offset: 0x01C (R/ )  Consolidated Time Register 2 */
  __IO uint8_t  SEC;                        /*!< Offset: 0x020 (R/W)  Seconds Counter Register */
       uint8_t  RESERVED4[3];
  __IO uint8_t  MIN;                        /*!< Offset: 0x024 (R/W)  Minutes Register */
       uint8_t  RESERVED5[3];
  __IO uint8_t  HOUR;                       /*!< Offset: 0x028 (R/W)  Hours Register */
       uint8_t  RESERVED6[3];
  __IO uint8_t  DOM;                        /*!< Offset: 0x02C (R/W)  Day of Month Register */
       uint8_t  RESERVED7[3];
  __IO uint8_t  DOW;                        /*!< Offset: 0x030 (R/W)  Day of Week Register */
       uint8_t  RESERVED8[3];
  __IO uint16_t DOY;                        /*!< Offset: 0x034 (R/W)  Day of Year Register */
       uint16_t RESERVED9;
  __IO uint8_t  MONTH;                      /*!< Offset: 0x038 (R/W)  Months Register */
       uint8_t  RESERVED10[3];
  __IO uint16_t YEAR;                       /*!< Offset: 0x03C (R/W)  Years Register */
       uint16_t RESERVED11;
  __IO uint32_t CALIBRATION;                /*!< Offset: 0x040 (R/W)  Calibration Value Register */
  __IO uint32_t GPREG0;                     /*!< Offset: 0x044 (R/W)  General Purpose Register 0 */
  __IO uint32_t GPREG1;                     /*!< Offset: 0x048 (R/W)  General Purpose Register 1 */
  __IO uint32_t GPREG2;                     /*!< Offset: 0x04C (R/W)  General Purpose Register 2 */
  __IO uint32_t GPREG3;                     /*!< Offset: 0x050 (R/W)  General Purpose Register 3 */
  __IO uint32_t GPREG4;                     /*!< Offset: 0x054 (R/W)  General Purpose Register 4 */
  __IO uint8_t  RTC_AUXEN;                  /*!< Offset: 0x058 (R/W)  RTC Auxiliary Enable Register */
       uint8_t  RESERVED12[3];
  __IO uint8_t  RTC_AUX;                    /*!< Offset: 0x05C (R/W)  RTC Auxiliary Control Register */
       uint8_t  RESERVED13[3];
  __IO uint8_t  ALSEC;                      /*!< Offset: 0x060 (R/W)  Alarm value for Seconds */
       uint8_t  RESERVED14[3];
  __IO uint8_t  ALMIN;                      /*!< Offset: 0x064 (R/W)  Alarm value for Minutes */
       uint8_t  RESERVED15[3];
  __IO uint8_t  ALHOUR;                     /*!< Offset: 0x068 (R/W)  Alarm value for Hours */
       uint8_t  RESERVED16[3];
  __IO uint8_t  ALDOM;                      /*!< Offset: 0x06C (R/W)  Alarm value for Day of Month */
       uint8_t  RESERVED17[3];
  __IO uint8_t  ALDOW;                      /*!< Offset: 0x070 (R/W)  Alarm value for Day of Week */
       uint8_t  RESERVED18[3];
  __IO uint16_t ALDOY;                      /*!< Offset: 0x074 (R/W)  Alarm value for Day of Year */
       uint16_t RESERVED19;
  __IO uint8_t  ALMON;                      /*!< Offset: 0x078 (R/W)  Alarm value for Months */
       uint8_t  RESERVED20[3];
  __IO uint16_t ALYEAR;                     /*!< Offset: 0x07C (R/W)  Alarm value for Year */
       uint16_t RESERVED21;
  __IO uint32_t ERSTATUS;                   /*!< Offset: 0x080 (R/W)  Event Recorder Status Register */
  __IO uint32_t ERCONTROL;                  /*!< Offset: 0x084 (R/W)  Event Recorder Control Register */
  __I  uint32_t ERCOUNTERS;                 /*!< Offset: 0x088 (R/ )  Event Recorder Counters Register */
       uint32_t RESERVED22;
  __I  uint32_t ERFIRSTSTAMP0;              /*!< Offset: 0x090 (R/ )  Event Recorder First Stamp Register Channel 0 */
  __I  uint32_t ERFIRSTSTAMP1;              /*!< Offset: 0x094 (R/ )  Event Recorder First Stamp Register Channel 1 */
  __I  uint32_t ERFIRSTSTAMP2;              /*!< Offset: 0x098 (R/ )  Event Recorder First Stamp Register Channel 2 */
       uint32_t RESERVED23;
  __I  uint32_t ERLASTSTAMP0;               /*!< Offset: 0x0A0 (R/ )  Event Recorder Last Stamp Register Channel 0 */
  __I  uint32_t ERLASTSTAMP1;               /*!< Offset: 0x0A4 (R/ )  Event Recorder Last Stamp Register Channel 1 */
  __I  uint32_t ERLASTSTAMP2;               /*!< Offset: 0x0A8 (R/ )  Event Recorder Last Stamp Register Channel 2 */
} LPC_RTC_TypeDef;

/*------------- Watchdog Timer (WDT) -----------------------------------------*/
typedef struct
{
  __IO uint8_t  MOD;                        /*!< Offset: 0x000 (R/W)  Watchdog mode Register */
       uint8_t  RESERVED0[3];
  __IO uint32_t TC;                         /*!< Offset: 0x004 (R/W)  Watchdog timer constant Register */
  __O  uint8_t  FEED;                       /*!< Offset: 0x008 ( /W)  Watchdog feed sequence Register */
       uint8_t  RESERVED1[3];
  __I  uint32_t TV;                         /*!< Offset: 0x00C (R/ )  Watchdog timer value Register */
       uint32_t RESERVED2;
  __IO uint32_t WARNINT;                    /*!< Offset: 0x010 (R/W)  Watchdog Warning Interrupt compare value Register */
  __IO uint32_t WINDOW;                     /*!< Offset: 0x014 (R/W)  Watchdog Window compare value Register */
} LPC_WDT_TypeDef;

