QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/include/platform/hal/nxp/mcu/LPC17xx/vendor/LPC1788.h
typedef struct                          /* Central Registers                  */
{
  __I  uint32_t TxSR;                       /*!< Offset: 0x000 (R/ )  CAN Central Transmit Status Register */
  __I  uint32_t RxSR;                       /*!< Offset: 0x004 (R/ )  CAN Central Receive Status Register */
  __I  uint32_t MSR;                        /*!< Offset: 0x008 (R/ )  CAN Central Miscellaneous Register */
} LPC_CANCR_TypeDef;

typedef struct                          /* Controller Registers               */
{
  __IO uint32_t MOD;                        /*!< Offset: 0x000 (R/W)  CAN Mode Register */
  __O  uint32_t CMR;                        /*!< Offset: 0x004 ( /W)  CAN Command Register */
  __IO uint32_t GSR;                        /*!< Offset: 0x008 (R/W)  CAN Global Status Register */
  __I  uint32_t ICR;                        /*!< Offset: 0x00C (R/ )  CAN Interrupt and Capture Register */
  __IO uint32_t IER;                        /*!< Offset: 0x010 (R/W)  CAN Interrupt Enable Register */
  __IO uint32_t BTR;                        /*!< Offset: 0x014 (R/W)  CAN Bus Timing Register */
  __IO uint32_t EWL;                        /*!< Offset: 0x018 (R/W)  CAN Error Warning Limit Register */
  __I  uint32_t SR;                         /*!< Offset: 0x01C (R/ )  CAN Status Register */
  __IO uint32_t RFS;                        /*!< Offset: 0x020 (R/W)  CAN Receive Frame Status Register */
  __IO uint32_t RID;                        /*!< Offset: 0x024 (R/W)  CAN Receive Identifier Register */
  __IO uint32_t RDA;                        /*!< Offset: 0x028 (R/W)  CAN Receive Data Register A */
  __IO uint32_t RDB;                        /*!< Offset: 0x02C (R/W)  CAN Receive Data Register B */
  __IO uint32_t TFI1;                       /*!< Offset: 0x030 (R/W)  CAN Transmit Frame Information Register 1 */
  __IO uint32_t TID1;                       /*!< Offset: 0x034 (R/W)  CAN Transmit Identifier Register 1 */
  __IO uint32_t TDA1;                       /*!< Offset: 0x038 (R/W)  CAN Transmit Data Register A 1 */
  __IO uint32_t TDB1;                       /*!< Offset: 0x03C (R/W)  CAN Transmit Data Register B 1 */
  __IO uint32_t TFI2;                       /*!< Offset: 0x040 (R/W)  CAN Transmit Frame Information Register 2 */
  __IO uint32_t TID2;                       /*!< Offset: 0x044 (R/W)  CAN Transmit Identifier Register 2 */
  __IO uint32_t TDA2;                       /*!< Offset: 0x048 (R/W)  CAN Transmit Data Register A 2 */
  __IO uint32_t TDB2;                       /*!< Offset: 0x04C (R/W)  CAN Transmit Data Register B 2 */
  __IO uint32_t TFI3;                       /*!< Offset: 0x050 (R/W)  CAN Transmit Frame Information Register 3 */
  __IO uint32_t TID3;                       /*!< Offset: 0x054 (R/W)  CAN Transmit Identifier Register 3 */
  __IO uint32_t TDA3;                       /*!< Offset: 0x058 (R/W)  CAN Transmit Data Register A 3 */
  __IO uint32_t TDB3;                       /*!< Offset: 0x05C (R/W)  CAN Transmit Data Register B 3 */
} LPC_CAN_TypeDef;

/*------------- General Purpose Direct Memory Access (GPDMA) -----------------*/
typedef struct                          /* Common Registers                   */
{
  __I  uint32_t IntStat;                    /*!< Offset: 0x000 (R/ )  DMA Interrupt Status Register */
  __I  uint32_t IntTCStat;                  /*!< Offset: 0x004 (R/ )  DMA Interrupt Terminal Count Request Status Register */
  __O  uint32_t IntTCClear;                 /*!< Offset: 0x008 ( /W)  DMA Interrupt Terminal Count Request Clear Register */
  __I  uint32_t IntErrStat;                 /*!< Offset: 0x00C (R/ )  DMA Interrupt Error Status Register */
  __O  uint32_t IntErrClr;                  /*!< Offset: 0x010 ( /W)  DMA Interrupt Error Clear Register */
  __I  uint32_t RawIntTCStat;               /*!< Offset: 0x014 (R/ )  DMA Raw Interrupt Terminal Count Status Register */
  __I  uint32_t RawIntErrStat;              /*!< Offset: 0x018 (R/ )  DMA Raw Error Interrupt Status Register */
  __I  uint32_t EnbldChns;                  /*!< Offset: 0x01C (R/ )  DMA Enabled Channel Register */
  __IO uint32_t SoftBReq;                   /*!< Offset: 0x020 (R/W)  DMA Software Burst Request Register */
  __IO uint32_t SoftSReq;                   /*!< Offset: 0x024 (R/W)  DMA Software Single Request Register */
  __IO uint32_t SoftLBReq;                  /*!< Offset: 0x028 (R/W)  DMA Software Last Burst Request Register */
  __IO uint32_t SoftLSReq;                  /*!< Offset: 0x02C (R/W)  DMA Software Last Single Request Register */
  __IO uint32_t Config;                     /*!< Offset: 0x030 (R/W)  DMA Configuration Register */
  __IO uint32_t Sync;                       /*!< Offset: 0x034 (R/W)  DMA Synchronization Register */
} LPC_GPDMA_TypeDef;

typedef struct                          /* Channel Registers                  */
{
  __IO uint32_t CSrcAddr;                   /*!< Offset: 0x000 (R/W)  DMA Channel # Source Address Register */
  __IO uint32_t CDestAddr;                  /*!< Offset: 0x004 (R/W)  DMA Channel # Destination Address Register */
  __IO uint32_t CLLI;                       /*!< Offset: 0x008 (R/W)  DMA Channel # Linked List Item Register */
  __IO uint32_t CControl;                   /*!< Offset: 0x00C (R/W)  DMA Channel # Control Register */
  __IO uint32_t CConfig;                    /*!< Offset: 0x010 (R/W)  DMA Channel # Configuration Register */
} LPC_GPDMACH_TypeDef;

/*------------- Universal Serial Bus (USB) -----------------------------------*/
typedef struct
{
  __I  uint32_t HcRevision;                 /*!< Offset: 0x000 (R/ )  Revision Register */
  __IO uint32_t HcControl;                  /*!< Offset: 0x004 (R/W)  Control Register */
  __IO uint32_t HcCommandStatus;            /*!< Offset: 0x008 (R/W)  Command / Status Register */
  __IO uint32_t HcInterruptStatus;          /*!< Offset: 0x00C (R/W)  Interrupt Status Register */
  __IO uint32_t HcInterruptEnable;          /*!< Offset: 0x010 (R/W)  Interrupt Enable Register */
  __IO uint32_t HcInterruptDisable;         /*!< Offset: 0x014 (R/W)  Interrupt Disable Register */
  __IO uint32_t HcHCCA;                     /*!< Offset: 0x018 (R/W)  Host Controller communication Area Register */
  __I  uint32_t HcPeriodCurrentED;          /*!< Offset: 0x01C (R/ )   Register */
  __IO uint32_t HcControlHeadED;            /*!< Offset: 0x020 (R/W)   Register */
  __IO uint32_t HcControlCurrentED;         /*!< Offset: 0x024 (R/W)   Register */
  __IO uint32_t HcBulkHeadED;               /*!< Offset: 0x028 (R/W)   Register */
  __IO uint32_t HcBulkCurrentED;            /*!< Offset: 0x02C (R/W)   Register */
  __I  uint32_t HcDoneHead;                 /*!< Offset: 0x030 (R/ )   Register */
  __IO uint32_t HcFmInterval;               /*!< Offset: 0x034 (R/W)   Register */
  __I  uint32_t HcFmRemaining;              /*!< Offset: 0x038 (R/ )   Register */
  __I  uint32_t HcFmNumber;                 /*!< Offset: 0x03C (R/ )   Register */
  __IO uint32_t HcPeriodicStart;            /*!< Offset: 0x040 (R/W)   Register */
  __IO uint32_t HcLSTreshold;               /*!< Offset: 0x044 (R/W)   Register */
  __IO uint32_t HcRhDescriptorA;            /*!< Offset: 0x048 (R/W)   Register */
  __IO uint32_t HcRhDescriptorB;            /*!< Offset: 0x04C (R/W)   Register */
  __IO uint32_t HcRhStatus;                 /*!< Offset: 0x050 (R/W)   Register */
  __IO uint32_t HcRhPortStatus1;            /*!< Offset: 0x054 (R/W)   Register */
  __IO uint32_t HcRhPortStatus2;            /*!< Offset: 0x05C (R/W)   Register */
       uint32_t RESERVED0[40];
  __I  uint32_t Module_ID;                  /*!< Offset: 0x0FC (R/ )  Module ID / Version Reverence ID Register */
                                            /* USB On-The-Go Registers            */
  __I  uint32_t OTGIntSt;                   /*!< Offset: 0x100 (R/ )  OTG Interrupt Status Register */
  __IO uint32_t OTGIntEn;                   /*!< Offset: 0x104 (R/W)  OTG Interrupt Enable Register */
  __O  uint32_t OTGIntSet;                  /*!< Offset: 0x108 ( /W)  OTG Interrupt Set Register */
  __O  uint32_t OTGIntClr;                  /*!< Offset: 0x10C ( /W)  OTG Interrupt Clear Register */
  __IO uint32_t OTGStCtrl;                  /*!< Offset: 0x110 (R/W)  OTG Status and Control Register */
  __IO uint32_t OTGTmr;                     /*!< Offset: 0x114 (R/W)  OTG Timer Register */
       uint32_t RESERVED1[58];
                                            /* USB Device Interrupt Registers     */
  __I  uint32_t USBDevIntSt;                /*!< Offset: 0x200 (R/ )  USB Device Interrupt Status Register */
  __IO uint32_t USBDevIntEn;                /*!< Offset: 0x204 (R/W)  USB Device Interrupt Enable Register */
  __O  uint32_t USBDevIntClr;               /*!< Offset: 0x208 ( /W)  USB Device Interrupt Clear Register */
  __O  uint32_t USBDevIntSet;               /*!< Offset: 0x20C ( /W)  USB Device Interrupt Set Register */
                                            /* USB Device SIE Command Registers   */
  __O  uint32_t USBCmdCode;                 /*!< Offset: 0x210 (R/W)  USB Command Code Register */
  __I  uint32_t USBCmdData;                 /*!< Offset: 0x214 (R/W)  USB Command Data Register */
                                            /* USB Device Transfer Registers      */
  __I  uint32_t USBRxData;                  /*!< Offset: 0x218 (R/ )  USB Receive Data Register */
  __O  uint32_t USBTxData;                  /*!< Offset: 0x21C ( /W)  USB Transmit Data Register */
  __I  uint32_t USBRxPLen;                  /*!< Offset: 0x220 (R/ )  USB Receive Packet Length Register */
  __O  uint32_t USBTxPLen;                  /*!< Offset: 0x224 ( /W)  USB Transmit Packet Length Register */
  __IO uint32_t USBCtrl;                    /*!< Offset: 0x228 (R/W)  USB Control Register */
  __O  uint32_t USBDevIntPri;               /*!< Offset: 0x22C (R/W)  USB Device Interrupt Priority Register */
                                            /* USB Device Endpoint Interrupt Regs */
  __I  uint32_t USBEpIntSt;                 /*!< Offset: 0x230 (R/ )  USB Endpoint Interrupt Status Register */
  __IO uint32_t USBEpIntEn;                 /*!< Offset: 0x234 (R/W)  USB Endpoint Interrupt Enable Register */
  __O  uint32_t USBEpIntClr;                /*!< Offset: 0x238 ( /W)  USB Endpoint Interrupt Clear Register */
  __O  uint32_t USBEpIntSet;                /*!< Offset: 0x23C ( /W)  USB Endpoint Interrupt Set Register */
  __O  uint32_t USBEpIntPri;                /*!< Offset: 0x240 ( /W)  USB Endpoint Interrupt Priority Register */
                                            /* USB Device Endpoint Realization Reg*/
  __IO uint32_t USBReEp;                    /*!< Offset: 0x244 (R/W)  USB Realize Endpoint Register */
  __O  uint32_t USBEpInd;                   /*!< Offset: 0x248 ( /W)  USB Endpoint Index Register */
  __IO uint32_t USBMaxPSize;                /*!< Offset: 0x24C (R/W)  USB MaxPacketSize Register */
                                            /* USB Device DMA Registers           */
  __I  uint32_t USBDMARSt;                  /*!< Offset: 0x250 (R/ )  USB DMA Request Status Register */
  __O  uint32_t USBDMARClr;                 /*!< Offset: 0x254 ( /W)  USB DMA Request Clear Register */
  __O  uint32_t USBDMARSet;                 /*!< Offset: 0x258 ( /W)  USB DMA Request Set Register */
       uint32_t RESERVED2[9];
  __IO uint32_t USBUDCAH;                   /*!< Offset: 0x280 (R/W)  USB UDCA Head Register */
  __I  uint32_t USBEpDMASt;                 /*!< Offset: 0x284 (R/ )  USB EP DMA Status Register */
  __O  uint32_t USBEpDMAEn;                 /*!< Offset: 0x288 ( /W)  USB EP DMA Enable Register */
  __O  uint32_t USBEpDMADis;                /*!< Offset: 0x28C ( /W)  USB EP DMA Disable Register */
  __I  uint32_t USBDMAIntSt;                /*!< Offset: 0x290 (R/ )  USB DMA Interrupt Status Register */
  __IO uint32_t USBDMAIntEn;                /*!< Offset: 0x294 (R/W)  USB DMA Interrupt Enable Register */
       uint32_t RESERVED3[2];
  __I  uint32_t USBEoTIntSt;                /*!< Offset: 0x2A0 (R/ )  USB End of Transfer Interrupt Status Register */
  __O  uint32_t USBEoTIntClr;               /*!< Offset: 0x2A4 ( /W)  USB End of Transfer Interrupt Clear Register */
  __O  uint32_t USBEoTIntSet;               /*!< Offset: 0x2A8 ( /W)  USB End of Transfer Interrupt Set Register */
  __I  uint32_t USBNDDRIntSt;               /*!< Offset: 0x2AC (R/ )  USB New DD Request Interrupt Status Register */
  __O  uint32_t USBNDDRIntClr;              /*!< Offset: 0x2B0 ( /W)  USB New DD Request Interrupt Clear Register */
  __O  uint32_t USBNDDRIntSet;              /*!< Offset: 0x2B4 ( /W)  USB New DD Request Interrupt Set Register */
  __I  uint32_t USBSysErrIntSt;             /*!< Offset: 0x2B8 (R/ )  USB System Error Interrupt Status Register */
  __O  uint32_t USBSysErrIntClr;            /*!< Offset: 0x2BC ( /W)  USB System Error Interrupt Clear Register */
  __O  uint32_t USBSysErrIntSet;            /*!< Offset: 0x2C0 ( /W)  USB System Error Interrupt Set Register */
       uint32_t RESERVED4[15];
                                            /* USB OTG I2C Registers              */
  union {
  __I  uint32_t I2C_RX;                     /*!< Offset: 0x300 (R/ )  OTG I2C Receive Register */
  __O  uint32_t I2C_TX;                     /*!< Offset: 0x300 ( /W)  OTG I2C Transmit Register */
  };
  __I  uint32_t I2C_STS;                    /*!< Offset: 0x304 (R/ )  OTG I2C Status Register */
  __IO uint32_t I2C_CTL;                    /*!< Offset: 0x308 (R/W)  OTG I2C Control Register */
  __IO uint32_t I2C_CLKHI;                  /*!< Offset: 0x30C (R/W)  OTG I2C Clock High Register */
  __O  uint32_t I2C_CLKLO;                  /*!< Offset: 0x310 ( /W)  OTG I2C Clock Low Register */
       uint32_t RESERVED5[824];
                                            /* USB Clock Control Registers        */
  union {
  __IO uint32_t USBClkCtrl;                 /*!< Offset: 0xFF4 (R/W)  OTG clock controller Register */
  __IO uint32_t OTGClkCtrl;                 /*!< Offset: 0xFF4 (R/W)  USB clock controller Register */
  };
  union {
  __I  uint32_t USBClkSt;                   /*!< Offset: 0xFF8 (R/ )  OTG clock status Register */
  __I  uint32_t OTGClkSt;                   /*!< Offset: 0xFF8 (R/ )  USB clock status Register */
  };
} LPC_USB_TypeDef;

/*------------- Ethernet Media Access Controller (EMAC) ----------------------*/
typedef struct
{
  __IO uint32_t MAC1;                       /*!< Offset: 0x000 (R/W)  MAC Configuration Register 1 */
  __IO uint32_t MAC2;                       /*!< Offset: 0x004 (R/W)  MAC Configuration Register 2 */
  __IO uint32_t IPGT;                       /*!< Offset: 0x008 (R/W)  Back-to-Back Inter-Packet-Gap Register */
  __IO uint32_t IPGR;                       /*!< Offset: 0x00C (R/W)  Non Back-to-Back Inter-Packet-Gap Register */
  __IO uint32_t CLRT;                       /*!< Offset: 0x010 (R/W)  Collision Window / Retry Register */
  __IO uint32_t MAXF;                       /*!< Offset: 0x014 (R/W)  Maximum Frame Register */
  __IO uint32_t SUPP;                       /*!< Offset: 0x018 (R/W)  PHY Support Register */
  __IO uint32_t TEST;                       /*!< Offset: 0x01C (R/W)  Test Register */
  __IO uint32_t MCFG;                       /*!< Offset: 0x020 (R/W)  MII Mgmt Configuration Register */
  __IO uint32_t MCMD;                       /*!< Offset: 0x024 (R/W)  MII Mgmt Command Register */
  __IO uint32_t MADR;                       /*!< Offset: 0x028 (R/W)  MII Mgmt Address Register */
  __O  uint32_t MWTD;                       /*!< Offset: 0x02C ( /W)  MII Mgmt Write Data Register */
  __I  uint32_t MRDD;                       /*!< Offset: 0x030 (R/ )  MII Mgmt Read Data Register */
  __I  uint32_t MIND;                       /*!< Offset: 0x034 (R/ )  MII Mgmt Indicators Register */
       uint32_t RESERVED0[2];
  __IO uint32_t SA0;                        /*!< Offset: 0x040 (R/W)  Station Address 0 Register */
  __IO uint32_t SA1;                        /*!< Offset: 0x044 (R/W)  Station Address 1 Register */
  __IO uint32_t SA2;                        /*!< Offset: 0x048 (R/W)  Station Address 2 Register */
       uint32_t RESERVED1[45];
  __IO uint32_t Command;                    /*!< Offset: 0x100 (R/W)  Command Register */
  __I  uint32_t Status;                     /*!< Offset: 0x104 (R/ )  Status Register */
  __IO uint32_t RxDescriptor;               /*!< Offset: 0x108 (R/W)  Receive Descriptor Base Address Register */
  __IO uint32_t RxStatus;                   /*!< Offset: 0x10C (R/W)  Receive Status Base Address Register */
  __IO uint32_t RxDescriptorNumber;         /*!< Offset: 0x110 (R/W)  Receive Number of Descriptors Register */
  __I  uint32_t RxProduceIndex;             /*!< Offset: 0x114 (R/ )  Receive Produce Index Register */
  __IO uint32_t RxConsumeIndex;             /*!< Offset: 0x118 (R/W)  Receive Consume Index Register */
  __IO uint32_t TxDescriptor;               /*!< Offset: 0x11C (R/W)  Transmit Descriptor Base Address Register */
  __IO uint32_t TxStatus;                   /*!< Offset: 0x120 (R/W)  Transmit Status Base Address Register */
  __IO uint32_t TxDescriptorNumber;         /*!< Offset: 0x124 (R/W)  Transmit Number of Descriptors Register */
  __IO uint32_t TxProduceIndex;             /*!< Offset: 0x128 (R/W)  Transmit Produce Index Register */
  __I  uint32_t TxConsumeIndex;             /*!< Offset: 0x12C (R/ )  Transmit Consume Index Register */
       uint32_t RESERVED2[10];
  __I  uint32_t TSV0;                       /*!< Offset: 0x158 (R/ )  Transmit Status Vector 0 Register */
  __I  uint32_t TSV1;                       /*!< Offset: 0x15C (R/ )  Transmit Status Vector 1 Register */
  __I  uint32_t RSV;                        /*!< Offset: 0x160 (R/ )  Receive Status Vector Register */
       uint32_t RESERVED3[3];
  __IO uint32_t FlowControlCounter;         /*!< Offset: 0x170 (R/W)  Flow Control Counter Register */
  __I  uint32_t FlowControlStatus;          /*!< Offset: 0x174 (R/ )  Flow Control Status egister */
       uint32_t RESERVED4[34];
  __IO uint32_t RxFilterCtrl;               /*!< Offset: 0x200 (R/W)  Receive Filter Control Register */
  __I  uint32_t RxFilterWoLStatus;          /*!< Offset: 0x204 (R/ )  Receive Filter WoL Status Register */
  __O  uint32_t RxFilterWoLClear;           /*!< Offset: 0x208 ( /W)  Receive Filter WoL Clear Register */
       uint32_t RESERVED5;
  __IO uint32_t HashFilterL;                /*!< Offset: 0x210 (R/W)  Hash Filter Table LSBs Register */
  __IO uint32_t HashFilterH;                /*!< Offset: 0x214 (R/W)  Hash Filter Table MSBs Register */
       uint32_t RESERVED6[882];
  __I  uint32_t IntStatus;                  /*!< Offset: 0xFE0 (R/ )  Interrupt Status Register */
  __IO uint32_t IntEnable;                  /*!< Offset: 0xFE4 (R/W)  Interrupt Enable Register */
  __O  uint32_t IntClear;                   /*!< Offset: 0xFE8 ( /W)  Interrupt Clear Register */
  __O  uint32_t IntSet;                     /*!< Offset: 0xFEC ( /W)  Interrupt Set Register */
       uint32_t RESERVED7;
  __IO uint32_t PowerDown;                  /*!< Offset: 0xFF4 (R/W)  Power-Down Register */
} LPC_EMAC_TypeDef;

/*------------- LCD controller (LCD) -----------------------------------------*/
typedef struct
{
  __IO uint32_t TIMH;                       /*!< Offset: 0x000 (R/W)  Horizontal Timing Control Register */
  __IO uint32_t TIMV;                       /*!< Offset: 0x004 (R/W)  Vertical Timing Control Register */
  __IO uint32_t POL;                        /*!< Offset: 0x008 (R/W)  Clock and Signal Polarity Control Register */
  __IO uint32_t LE;                         /*!< Offset: 0x00C (R/W)  Line End Control Register */
  __IO uint32_t UPBASE;                     /*!< Offset: 0x010 (R/W)  Upper Panel Frame Base Address Register */
  __IO uint32_t LPBASE;                     /*!< Offset: 0x014 (R/W)  Lower Panel Frame Base Address Register */
  __IO uint32_t CTRL;                       /*!< Offset: 0x018 (R/W)  LCD Control Register */
  __IO uint32_t INTMSK;                     /*!< Offset: 0x01C (R/W)  Interrupt Mask Register */
  __I  uint32_t INTRAW;                     /*!< Offset: 0x020 (R/ )  Raw Interrupt Status Register */
  __I  uint32_t INTSTAT;                    /*!< Offset: 0x024 (R/ )  Masked Interrupt Status Register */
  __O  uint32_t INTCLR;                     /*!< Offset: 0x028 ( /W)  Interrupt Clear Register */
  __I  uint32_t UPCURR;                     /*!< Offset: 0x02C (R/ )  Upper Panel Current Address Value Register */
  __I  uint32_t LPCURR;                     /*!< Offset: 0x030 (R/ )  Lower Panel Current Address Value Register */
       uint32_t RESERVED0[115];
  __IO uint32_t PAL[128];                   /*!< Offset: 0x200 (R/W)  256x16-bit Color Palette Register */
       uint32_t RESERVED1[256];
  __IO uint32_t CRSR_IMG[256];              /*!< Offset: 0x800 (R/W)  Cursor Image Register */
  __IO uint32_t CRSR_CTRL;                  /*!< Offset: 0xC00 (R/W)  Cursor Control Register */
  __IO uint32_t CRSR_CFG;                   /*!< Offset: 0xC04 (R/W)  Cursor Configuration Register */
  __IO uint32_t CRSR_PAL0;                  /*!< Offset: 0xC08 (R/W)  Cursor Palette Register 0 */
  __IO uint32_t CRSR_PAL1;                  /*!< Offset: 0xC0C (R/W)  Cursor Palette Register 1 */
  __IO uint32_t CRSR_XY;                    /*!< Offset: 0xC10 (R/W)  Cursor XY Position Register */
  __IO uint32_t CRSR_CLIP;                  /*!< Offset: 0xC14 (R/W)  Cursor Clip Position Register */
       uint32_t RESERVED2[2];
  __IO uint32_t CRSR_INTMSK;                /*!< Offset: 0xC20 (R/W)  Cursor Interrupt Mask Register */
  __O  uint32_t CRSR_INTCLR;                /*!< Offset: 0xC24 ( /W)  Cursor Interrupt Clear Register */
  __I  uint32_t CRSR_INTRAW;                /*!< Offset: 0xC28 (R/ )  Cursor Raw Interrupt Status Register */
  __I  uint32_t CRSR_INTSTAT;               /*!< Offset: 0xC2C (R/ )  Cursor Masked Interrupt Status Register */
} LPC_LCD_TypeDef;

