QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/include/platform/hal/nxp/mcu/LPC17xx/vendor/LPC1788.h
/*------------- External Memory Controller (EMC) -----------------------------*/
typedef struct
{
  __IO uint32_t Control;                    /*!< Offset: 0x000 (R/W)  EMC Control Register */
  __I  uint32_t Status;                     /*!< Offset: 0x004 (R/ )  EMC Status Register */
  __IO uint32_t Config;                     /*!< Offset: 0x008 (R/W)  EMC Configuration Register */
       uint32_t RESERVED0[5];
  __IO uint32_t DynamicControl;             /*!< Offset: 0x020 (R/W)  Dynamic Memory Control Register */
  __IO uint32_t DynamicRefresh;             /*!< Offset: 0x024 (R/W)  Dynamic Memory Refresh Timer Register */
  __IO uint32_t DynamicReadConfig;          /*!< Offset: 0x028 (R/W)  Dynamic Memory Read Configuration Register */
       uint32_t RESERVED1[1];
  __IO uint32_t DynamicRP;                  /*!< Offset: 0x030 (R/W)  Dynamic Memory Precharge Command Period Register */
  __IO uint32_t DynamicRAS;                 /*!< Offset: 0x034 (R/W)  Dynamic Memory Active to Precharge Command Period Register */
  __IO uint32_t DynamicSREX;                /*!< Offset: 0x038 (R/W)  Dynamic Memory Self-refresh Exit Time Register */
  __IO uint32_t DynamicAPR;                 /*!< Offset: 0x03C (R/W)  Dynamic Memory Last Data Out to Active Time Register */
  __IO uint32_t DynamicDAL;                 /*!< Offset: 0x040 (R/W)  Dynamic Memory Data-in to Active Command Time Register */
  __IO uint32_t DynamicWR;                  /*!< Offset: 0x044 (R/W)  Dynamic Memory Write Recovery Time Register */
  __IO uint32_t DynamicRC;                  /*!< Offset: 0x048 (R/W)  Dynamic Memory Active to Active Command Period Register */
  __IO uint32_t DynamicRFC;                 /*!< Offset: 0x04C (R/W)  Dynamic Memory Auto-refresh Period Register */
  __IO uint32_t DynamicXSR;                 /*!< Offset: 0x050 (R/W)  Dynamic Memory Exit Self-refresh Register */
  __IO uint32_t DynamicRRD;                 /*!< Offset: 0x054 (R/W)  Dynamic Memory Active Bank A to Active Bank B Time Register */
  __IO uint32_t DynamicMRD;                 /*!< Offset: 0x058 (R/W)  Dynamic Memory Load Mode register to Active Command Time Register */
       uint32_t RESERVED2[9];
  __IO uint32_t StaticExtendedWait;         /*!< Offset: 0x080 (R/W)  Static Memory Extended Wait Register */
       uint32_t RESERVED3[31];
  __IO uint32_t DynamicConfig0;             /*!< Offset: 0x100 (R/W)  Dynamic Memory Configuration Register 0 */
  __IO uint32_t DynamicRasCas0;             /*!< Offset: 0x104 (R/W)  Dynamic Memory RAS & CAS Delay Register 0 */
       uint32_t RESERVED4[6];
  __IO uint32_t DynamicConfig1;             /*!< Offset: 0x120 (R/W)  Dynamic Memory Configuration Register 1 */
  __IO uint32_t DynamicRasCas1;             /*!< Offset: 0x124 (R/W)  Dynamic Memory RAS & CAS Delay Register 1 */
       uint32_t RESERVED5[6];
  __IO uint32_t DynamicConfig2;             /*!< Offset: 0x140 (R/W)  Dynamic Memory Configuration Register 2 */
  __IO uint32_t DynamicRasCas2;             /*!< Offset: 0x144 (R/W)  Dynamic Memory RAS & CAS Delay Register 2 */
       uint32_t RESERVED6[6];
  __IO uint32_t DynamicConfig3;             /*!< Offset: 0x160 (R/W)  Dynamic Memory Configuration Register 3 */
  __IO uint32_t DynamicRasCas3;             /*!< Offset: 0x164 (R/W)  Dynamic Memory RAS & CAS Delay Register 3 */
       uint32_t RESERVED7[38];
  __IO uint32_t StaticConfig0;              /*!< Offset: 0x200 (R/W)  Static Memory Configuration Register 0 */
  __IO uint32_t StaticWaitWen0;             /*!< Offset: 0x204 (R/W)  Static Memory Write Enable Delay Register 0 */
  __IO uint32_t StaticWaitOen0;             /*!< Offset: 0x208 (R/W)  Static Memory Output Enable Delay Register 0 */
  __IO uint32_t StaticWaitRd0;              /*!< Offset: 0x20C (R/W)  Static Memory Read Delay Register 0 */
  __IO uint32_t StaticWaitPage0;            /*!< Offset: 0x210 (R/W)  Static Memory Page Mode Read Delay Register 0 */
  __IO uint32_t StaticWaitWr0;              /*!< Offset: 0x214 (R/W)  Static Memory Write Delay Register 0 */
  __IO uint32_t StaticWaitTurn0;            /*!< Offset: 0x218 (R/W)  Static Memory Turn Round Delay Register 0 */
       uint32_t RESERVED8[1];
  __IO uint32_t StaticConfig1;              /*!< Offset: 0x220 (R/W)  Static Memory Configuration Register 1 */
  __IO uint32_t StaticWaitWen1;             /*!< Offset: 0x224 (R/W)  Static Memory Write Enable Delay Register 1 */
  __IO uint32_t StaticWaitOen1;             /*!< Offset: 0x228 (R/W)  Static Memory Output Enable Delay Register 1 */
  __IO uint32_t StaticWaitRd1;              /*!< Offset: 0x22C (R/W)  Static Memory Read Delay Register 1 */
  __IO uint32_t StaticWaitPage1;            /*!< Offset: 0x230 (R/W)  Static Memory Page Mode Read Delay Register 1 */
  __IO uint32_t StaticWaitWr1;              /*!< Offset: 0x234 (R/W)  Static Memory Write Delay Register 1 */
  __IO uint32_t StaticWaitTurn1;            /*!< Offset: 0x238 (R/W)  Static Memory Turn Round Delay Register 1 */
       uint32_t RESERVED9[1];
  __IO uint32_t StaticConfig2;              /*!< Offset: 0x240 (R/W)  Static Memory Configuration Register 2 */
  __IO uint32_t StaticWaitWen2;             /*!< Offset: 0x244 (R/W)  Static Memory Write Enable Delay Register 2 */
  __IO uint32_t StaticWaitOen2;             /*!< Offset: 0x248 (R/W)  Static Memory Output Enable Delay Register 2 */
  __IO uint32_t StaticWaitRd2;              /*!< Offset: 0x24C (R/W)  Static Memory Read Delay Register 2 */
  __IO uint32_t StaticWaitPage2;            /*!< Offset: 0x250 (R/W)  Static Memory Page Mode Read Delay Register 2 */
  __IO uint32_t StaticWaitWr2;              /*!< Offset: 0x254 (R/W)  Static Memory Write Delay Register 2 */
  __IO uint32_t StaticWaitTurn2;            /*!< Offset: 0x258 (R/W)  Static Memory Turn Round Delay Register 2 */
       uint32_t RESERVED10[1];
  __IO uint32_t StaticConfig3;              /*!< Offset: 0x260 (R/W)  Static Memory Configuration Register 3 */
  __IO uint32_t StaticWaitWen3;             /*!< Offset: 0x264 (R/W)  Static Memory Write Enable Delay Register 3 */
  __IO uint32_t StaticWaitOen3;             /*!< Offset: 0x268 (R/W)  Static Memory Output Enable Delay Register 3 */
  __IO uint32_t StaticWaitRd3;              /*!< Offset: 0x26C (R/W)  Static Memory Read Delay Register 3 */
  __IO uint32_t StaticWaitPage3;            /*!< Offset: 0x270 (R/W)  Static Memory Page Mode Read Delay Register 3 */
  __IO uint32_t StaticWaitWr3;              /*!< Offset: 0x274 (R/W)  Static Memory Write Delay Register 3 */
  __IO uint32_t StaticWaitTurn3;            /*!< Offset: 0x278 (R/W)  Static Memory Turn Round Delay Register 3 */
} LPC_EMC_TypeDef;

/*------------- CRC Engine (CRC) -----------------------------------------*/
typedef struct
{
  __IO uint32_t MODE;                       /*!< Offset: 0x000 (R/W)  CRC mode Register */
  __IO uint32_t SEED;                       /*!< Offset: 0x004 (R/W)  CRC seed Register */
  union {
      __I  uint32_t SUM;                    /*!< Offset: 0x008 (R/ )  CRC checksum Register */
      __O  uint32_t WR_DATA_32;             /*!< Offset: 0x008 ( /W)  CRC data Register DWORD access */
    struct {
      __O  uint16_t WR_DATA_16;             /*!< Offset: 0x008 ( /W)  CRC data Register WORD access */
           uint16_t RESERVED_16;
    };
    struct {
      __O  uint8_t WR_DATA_8;               /*!< Offset: 0x008 ( /W)  CRC data Register Byte access */
           uint8_t RESERVED_8[3];
    };
  };
} LPC_CRC_TypeDef;

/*------------- SPIFI --------------------------------------------------------*/
typedef struct
{
  __IO uint32_t Control;
  __IO uint32_t Command;
  __IO uint32_t Address;
  __IO uint32_t IntermediateData;
  __IO uint32_t AddressIntermediate;
  __IO uint32_t Data;
  __IO uint32_t MemoryCommand;
  __I  uint32_t Status;
} LPC_SPIFI_TypeDef;

/*------------- EEPROM Controller (EEPROM) -----------------------------------*/
typedef struct
{
  __IO uint32_t CMD;                        /*!< Offset: 0x080 (R/W)  EEPROM command Register */
  __IO uint32_t ADDR;                       /*!< Offset: 0x084 (R/W)  EEPROM address Register */
  __O  uint32_t WDATA;                      /*!< Offset: 0x088 ( /W)  EEPROM write data Register */
  __I  uint32_t RDATA;                      /*!< Offset: 0x08C (R/ )  EEPROM read data Register */
  __IO uint32_t WSTATE;                     /*!< Offset: 0x090 (R/W)  EEPROM wait state Register */
  __IO uint32_t CLKDIV;                     /*!< Offset: 0x094 (R/W)  EEPROM clock divider Register */
  __IO uint32_t PWRDWN;                     /*!< Offset: 0x098 (R/W)  EEPROM power-down Register */
       uint32_t RESERVED1[975];
  __IO uint32_t INTENCLR;                   /*!< Offset: 0xFD8 (R/W)  EEPROM interrupt enable clear Register */
  __IO uint32_t INTENSET;                   /*!< Offset: 0xFDC (R/W)  EEPROM power-down Register */
  __IO uint32_t INTSTAT;                    /*!< Offset: 0xFE0 (R/W)  EEPROM power-down Register */
  __IO uint32_t INTEN;                      /*!< Offset: 0xFE4 (R/W)  EEPROM power-down Register */
  __IO uint32_t INTSTATCLR;                 /*!< Offset: 0xFE8 (R/W)  EEPROM power-down Register */
  __IO uint32_t INTSTATSET;                 /*!< Offset: 0xFEC (R/W)  EEPROM power-down Register */
} LPC_EEPROM_TypeDef;

//#pragma no_anon_unions


/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* Base addresses                                                             */
#define LPC_FLASH_BASE        (0x00000000UL)
#define LPC_RAM_BASE          (0x10000000UL)
#define LPC_APB0_BASE         (0x40000000UL)
#define LPC_APB1_BASE         (0x40080000UL)
#define LPC_AHB_BASE          (0x20080000UL)
#define LPC_CM3_BASE          (0xE0000000UL)

/* APB0 peripherals                                                           */
#define LPC_WDT_BASE          (LPC_APB0_BASE + 0x00000)
#define LPC_TIM0_BASE         (LPC_APB0_BASE + 0x04000)
#define LPC_TIM1_BASE         (LPC_APB0_BASE + 0x08000)
#define LPC_UART0_BASE        (LPC_APB0_BASE + 0x0C000)
#define LPC_UART1_BASE        (LPC_APB0_BASE + 0x10000)
#define LPC_PWM0_BASE         (LPC_APB0_BASE + 0x14000)
#define LPC_PWM1_BASE         (LPC_APB0_BASE + 0x18000)
#define LPC_I2C0_BASE         (LPC_APB0_BASE + 0x1C000)
#define LPC_RTC_BASE          (LPC_APB0_BASE + 0x24000)
#define LPC_GPIOINT_BASE      (LPC_APB0_BASE + 0x28080)
#define LPC_IOCON_BASE        (LPC_APB0_BASE + 0x2C000)
#define LPC_SSP1_BASE         (LPC_APB0_BASE + 0x30000)
#define LPC_ADC_BASE          (LPC_APB0_BASE + 0x34000)
#define LPC_CANAF_RAM_BASE    (LPC_APB0_BASE + 0x38000)
#define LPC_CANAF_BASE        (LPC_APB0_BASE + 0x3C000)
#define LPC_CANCR_BASE        (LPC_APB0_BASE + 0x40000)
#define LPC_CAN1_BASE         (LPC_APB0_BASE + 0x44000)
#define LPC_CAN2_BASE         (LPC_APB0_BASE + 0x48000)
#define LPC_I2C1_BASE         (LPC_APB0_BASE + 0x5C000)

/* APB1 peripherals                                                           */
#define LPC_SSP0_BASE         (LPC_APB1_BASE + 0x08000)
#define LPC_DAC_BASE          (LPC_APB1_BASE + 0x0C000)
#define LPC_TIM2_BASE         (LPC_APB1_BASE + 0x10000)
#define LPC_TIM3_BASE         (LPC_APB1_BASE + 0x14000)
#define LPC_UART2_BASE        (LPC_APB1_BASE + 0x18000)
#define LPC_UART3_BASE        (LPC_APB1_BASE + 0x1C000)
#define LPC_I2C2_BASE         (LPC_APB1_BASE + 0x20000)
#define LPC_UART4_BASE        (LPC_APB1_BASE + 0x24000)
#define LPC_I2S_BASE          (LPC_APB1_BASE + 0x28000)
#define LPC_SSP2_BASE         (LPC_APB1_BASE + 0x2C000)
#define LPC_MCPWM_BASE        (LPC_APB1_BASE + 0x38000)
#define LPC_QEI_BASE          (LPC_APB1_BASE + 0x3C000)
#define LPC_MCI_BASE          (LPC_APB1_BASE + 0x40000)
#define LPC_SC_BASE           (LPC_APB1_BASE + 0x7C000)

/* AHB peripherals                                                            */
#define LPC_GPDMA_BASE        (LPC_AHB_BASE  + 0x00000)
#define LPC_GPDMACH0_BASE     (LPC_AHB_BASE  + 0x00100)
#define LPC_GPDMACH1_BASE     (LPC_AHB_BASE  + 0x00120)
#define LPC_GPDMACH2_BASE     (LPC_AHB_BASE  + 0x00140)
#define LPC_GPDMACH3_BASE     (LPC_AHB_BASE  + 0x00160)
#define LPC_GPDMACH4_BASE     (LPC_AHB_BASE  + 0x00180)
#define LPC_GPDMACH5_BASE     (LPC_AHB_BASE  + 0x001A0)
#define LPC_GPDMACH6_BASE     (LPC_AHB_BASE  + 0x001C0)
#define LPC_GPDMACH7_BASE     (LPC_AHB_BASE  + 0x001E0)
#define LPC_EMAC_BASE         (LPC_AHB_BASE  + 0x04000)
#define LPC_LCD_BASE          (LPC_AHB_BASE  + 0x08000)
#define LPC_USB_BASE          (LPC_AHB_BASE  + 0x0C000)
#define LPC_CRC_BASE          (LPC_AHB_BASE  + 0x10000)
#define LPC_SPIFI_BASE        (LPC_AHB_BASE  + 0x14000)
#define LPC_GPIO0_BASE        (LPC_AHB_BASE  + 0x18000)
#define LPC_GPIO1_BASE        (LPC_AHB_BASE  + 0x18020)
#define LPC_GPIO2_BASE        (LPC_AHB_BASE  + 0x18040)
#define LPC_GPIO3_BASE        (LPC_AHB_BASE  + 0x18060)
#define LPC_GPIO4_BASE        (LPC_AHB_BASE  + 0x18080)
#define LPC_GPIO5_BASE        (LPC_AHB_BASE  + 0x180A0)
#define LPC_EMC_BASE          (LPC_AHB_BASE  + 0x1C000)

